#+title: Explore MISP API with pymisp

#+begin_src elisp :results silent :var path="./"
(pyvenv-activate (concat path "/venv"))
#+end_src


#+begin_src python :results output verbatim
from pymisp import ExpandedPyMISP, MISPEvent
#from pymisp.tools import EMailObject
from pymisp.tools import GenericObjectGenerator
import traceback
from uuid import UUID, uuid5
import datetime
#from keys import misp_url, misp_key, misp_verifycert  # type: ignore
import glob
import argparse

misp_key = "h8zzaGOa0mzG3RkYmyroza84WFmEeEHC9Obsa8IJ"
misp_url = "http://localhost"
misp_verifycert = False

misp = ExpandedPyMISP(misp_url, misp_key, misp_verifycert, debug=True)

def add_ref():
    event = MISPEvent()
    event.info = 'Dummy event'
    event.add_tag("Some tag")
    event.add_attribute("datetime", datetime.datetime.now(), comment="Start Time")
    event = misp.add_event(event, pythonify=True)

    misp_object = event.add_object(name='virustotal-report', comment="Some comment", standalone=False)
    vt_obj_uuid = misp_object.uuid

    misp_object = event.add_object(name='file', comment="file", standalone=False)
    misp_object.add_reference(referenced_uuid=vt_obj_uuid, relationship_type='analysed-with', comment='Expanded with virustotal data')
    misp.update_event(event)

def search_by_uuid():
    misp_parent_object_uuid = "4f7f2087-8a17-5ab3-88ac-98a7443a228e"
    response = misp.get_object(misp_parent_object_uuid, pythonify=True)
    print(response.event_id)
#search_by_uuid()
NAMESPACE = UUID("d72b7729-3b02-409d-ba30-b7f9a02fcf2d")
print(str(uuid5(NAMESPACE, "634a8ea522b81f03b75eb65a")))
print(str(uuid5(NAMESPACE, "634a9475ad7a846e38b67eef")))

#+end_src

#+RESULTS:
: 96813e14-417a-5d44-ae48-8e8dc46b3de8
: 9963f31f-85d2-5fa6-b4cd-207798c9e25a
